/*-
 * Copyright (c) 2017-2020, AT&T Intellectual Property.  All rights reserved.
 * Copyright (c) 2011-2017 by Brocade Communications Systems, Inc.
 * All rights reserved.
 */
/*
 *   BSD LICENSE
 *
 *   Copyright(c) 2010-2016 Intel Corporation. All rights reserved.
 *   All rights reserved.
 *
 * SPDX-License-Identifier: (LGPL-2.1-only AND BSD-3-Clause)
 *
 *   Redistribution and use in source and binary forms, with or without
 *   modification, are permitted provided that the following conditions
 *   are met:
 *
 *     * Redistributions of source code must retain the above copyright
 *       notice, this list of conditions and the following disclaimer.
 *     * Redistributions in binary form must reproduce the above copyright
 *       notice, this list of conditions and the following disclaimer in
 *       the documentation and/or other materials provided with the
 *       distribution.
 *     * Neither the name of Intel Corporation nor the names of its
 *       contributors may be used to endorse or promote products derived
 *       from this software without specific prior written permission.
 *
 *   THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 *   "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 *   LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 *   A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
 *   OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,

 * It has to be big enough that an initial burst of packets
 * can be processed by Tx thread which may be sleeping.
 */
#define PKT_RING_SIZE	2048

/* Union to allow atomic fetch */
union atomic_stat {
	uint64_t qword;
	uint32_t dword[2];
};

/* Temporary buffer to aggregate before going into the packet ring */
struct pkt_burst {
	uint8_t			port;	/* intended port */
	uint16_t		queue;  /* queue to use for multi-queue tx */
	uint32_t		count;	/* packets in burst */
	struct rte_mbuf *m_tbl[TX_PKT_BURST];	/* pending packets */
};

RTE_DEFINE_PER_LCORE(unsigned int, _dp_lcore_id) = 0;
static RTE_DEFINE_PER_LCORE(struct pkt_burst *, pkt_burst);

enum lcore_state {
	LCORE_STATE_POLL,
	LCORE_STATE_POWERSAVE,
	LCORE_STATE_IDLE,
	LCORE_STATE_EXIT,
};

/*
 * Per CPU configuration
 */
struct lcore_conf {
	/* mask of receive ports this cpu should check */
	bitmask_t portmask;

	uint16_t num_rxq;     /* # rx queues currently assigned to this cpu */
	uint16_t high_rxq;    /* highest index assigned to rx_poll */
	uint8_t num_txq;      /* # tx queues currently assigned to this cpu */
	bool running;         /* whether the forwarding loop is running */
	uint16_t high_txq;    /* highest index assigned to tx_poll */
	uint8_t tx_qid;	      /* my tx queue for multi-queue devices */
	uint8_t do_crypto;    /* thread is tasked with doing crypto */
	uint8_t crypto_fwd;   /* post-crypto forwarding workload present */

	/* receive queues this cpu should check for input */
	struct lcore_rx_queue {
		portid_t portid;
		uint8_t queueid;
		struct pm_governor gov;
		uint64_t packets;
	} rx_poll[MAX_RX_QUEUE_PER_CORE];

	/* transmit queues this cpu should do output processing on */
	struct lcore_tx_queue {
		portid_t portid;
		uint8_t queueid;
		uint8_t ringid;
		uint8_t pending : 7;
		/*
		 * Call transmit function even if there are no packets
		 * to send, e.g. for bonding 802.3ad mode where
		 * control packets share a queue with data packets.
		 */
		uint8_t tx_no_pkts : 1;
		struct pm_governor gov;
		uint64_t packets;
		struct rte_mbuf *burst[TX_PKT_BURST];
	} tx_poll[MAX_TX_QUEUE_PER_CORE];

	struct lcore_crypt {
		struct pm_governor gov;
		uint64_t packets;
		struct cds_list_head pmd_list;
	} crypt;

	/* Not touched in forwarding path so at end to avoid false sharing */
	void *padding[0]   __rte_cache_aligned;
	struct rate_stats rx_poll_stats[MAX_RX_QUEUE_PER_CORE];
	struct rate_stats tx_poll_stats[MAX_TX_QUEUE_PER_CORE];
	struct rate_stats crypt_stats;
	struct rate_stats crypt_fwd_stats;
	bool ded_to_feature;

	/* State for when a feature has registered to use this core */
	uint8_t do_feature;
	struct dp_lcore_feat feat;
	struct rate_stats feat_rx_stats;
	struct rate_stats feat_tx_stats;
} __rte_cache_aligned;

static struct lcore_conf *lcore_conf[RTE_MAX_LCORE];

/* Is the rx/tx queue reusable.
 * Must be > maximum portid (RTE_MAX_ETHPORTS)
 */
static const uint8_t NO_OWNER = 255;

/* Port configuration */
static struct port_conf {
	struct rte_ring *pkt_ring[MAX_TX_QUEUE_PER_PORT];	/*  0 32 */
	uint8_t		nrings;					/* 32  1 */
	uint8_t		max_rings;				/* 33  1 */
	bool		percoreq;				/* 34  1 */

	/* XXX 5 bytes hole, try to pack. */

	bitmask_t	tx_enabled_queues;			/* 40 16 */
	bitmask_t	rx_enabled_queues;			/* 56 16 */

	/* size: 128, cachlines: 2, members: 6 */
	/* sum members: 57, holes: 1, sum holes: 5 */
	/* padding: 56 */
} __rte_cache_aligned port_config[DATAPLANE_MAX_PORTS] __hot_data;

/* Port allocations */
static struct port_alloc {
	uint64_t		 dev_flags;			/*   0  8 */
	uint32_t		 buf_size;			/*   8  4 */
	uint16_t		 rx_desc;			/*  12  2 */
	uint16_t		 tx_desc;			/*  14  2 */
	uint32_t		 buffers;			/*  16  4 */
	uint8_t			 rx_queues;			/*  20  1 */
	uint8_t			 tx_queues;			/*  20  1 */
	int8_t			 socketid;			/*  22  1 */
	bool			 uses_queue_state;		/*  23  1 */
	bitmask_t		 rx_cpu_affinity;		/*  24 16 */
	bitmask_t		 tx_cpu_affinity;		/*  40 16 */
	struct rte_eth_txconf    tx_conf;			/*  56 56 */
	/* --- cacheline 1 boundary (64 bytes) was 48 bytes ago --- */
	struct rte_eth_rxconf    rx_conf;			/* 112 48 */
	/* --- cacheline 2 boundary (128 bytes) was 32 bytes ago --- */
	enum rte_eth_rx_mq_mode  rx_mq_mode;			/* 160  4 */

	/* XXX 4 bytes hole, try to packet */

	struct rte_mempool	*rx_pool;			/* 168  8 */

	/* size: 176, cachelines: 3, members: 15 */
	/* sum members: 172, holes: 1, sum holes: 4 */
	/* last cacheline: 48 bytes */
} port_allocations[DATAPLANE_MAX_PORTS];

/* Per socket mbuf pool */
static struct rte_mempool *numa_pool[RTE_MAX_NUMA_NODES];

/* Single CPU forwarding thread */
static pthread_t single_forward_thread;

/* DPDK owner for ports */
struct rte_eth_dev_owner owner = { .id = RTE_ETH_DEV_NO_OWNER };

/* Program name for log and usage message */
char *progname;

/* Command line flags */

volatile bool running = true;
uid_t dataplane_uid;
gid_t dataplane_gid;

bitmask_t enabled_port_mask;		/* port is valid */
bitmask_t poll_port_mask;		/* should be polled */
/* port should be polled and is link up */
bitmask_t active_port_mask __hot_data;

uint16_t nb_ports_total;		/* highest DPDK portid + 1 */

static bool daemon_mode;		/* become daemon */
static unsigned int avail_cores;		/* number of forwarding cores */
